public class BookInfo {
    public void show_book_items(){
        Object[][] book_items={
            {"新手起步指南",45,"蔷薇骑士","冒险家协会出版社",1},
            {"魔力概论",60,"蔷薇骑士","冒险家协会出版社",2},
            {"画中境历史",50,"七画","空域出版社",3},
            {"恶魔的自我修养",120,"七画","空域出版社",4},
            {"大贤者必会500题",100,"伊雷娜","魔法师协会",5},
            {"十二神面试模拟题",350,"伊雷娜","魔法师协会",6},
            {"非碳基生物进化论",125,"鬼面公主","历史研究协会",7},
            {"墓地文明的毁灭",175,"鬼面公主","历史研究协会",8}
        };
        for(Object x[]:book_items){
            System.out.println("《"+x[0]+"》价格："+x[1]+"作者："+x[2]+"出版社："+x[3]+"id："+x[4]);
        }
    }
}
class BookInfoReturn{

}
